/**
 * Клас AdminPages містить шляхи (routes) для адміністративних сторінок.
 * Кожне поле — це окремий шлях для певної адмін-сторінки.
 */
class AdminPages {
	HOME = '/admin' // Головна сторінка адмін-панелі
	MANAGER = '/manager' // Сторінка менеджера (можливо, для керування контентом/користувачами)
	PREMIUM = '/premium' // Сторінка для преміум-функцій або тарифів
	MAIN = '/main' // Основна сторінка (можливо, дашборд або головний розділ)
}

/**
 * Екземпляр класу AdminPages, який експортується для використання у всьому застосунку.
 * Дозволяє централізовано використовувати шляхи до адмін-сторінок через ADMIN_PAGES.*
 */
export const ADMIN_PAGES = new AdminPages()
